{"meta":{"title":"AnClark's Blog","subtitle":"","description":"","author":"AnClark Liu","url":"https://anclark.github.io/en","root":"/en/"},"pages":[],"posts":[{"title":"How to compile and install Openmediavault（OMV）","slug":"Play_NAS/OMV_Compile","date":"2019-10-05T13:10:12.000Z","updated":"2022-04-26T08:45:32.000Z","comments":true,"path":"2019/10/05/Play_NAS/OMV_Compile/","link":"","permalink":"https://anclark.github.io/en/2019/10/05/Play_NAS/OMV_Compile/","excerpt":"Openmediavault, known as OMV, could be the best choice among different open-source NAS solutions. Based on the great flexibility of Debian, together with its low consumption, OMV can work well on different hardware environments. Even my obsolete Intel Celeron D can still run well. Even though OMV is easy to use, it lacks documents, as the development team are all recommending to use their ready-to-use images, which is not so friendly with senior users. What’s more, guides to compile from scratch is just an empty paper, and you must guess what to do by yourself! After falling into plenty of traps, I won’t allow such an empty paper to hurt any beginners! So here comes my guide.","text":"Openmediavault, known as OMV, could be the best choice among different open-source NAS solutions. Based on the great flexibility of Debian, together with its low consumption, OMV can work well on different hardware environments. Even my obsolete Intel Celeron D can still run well. Even though OMV is easy to use, it lacks documents, as the development team are all recommending to use their ready-to-use images, which is not so friendly with senior users. What’s more, guides to compile from scratch is just an empty paper, and you must guess what to do by yourself! After falling into plenty of traps, I won’t allow such an empty paper to hurt any beginners! So here comes my guide. Preparations System: Debian 10 Buster, basic edition without any desktop environments Architecture: OMV’s official-recommended ‘AMD64, ARM, ARM64, and i386 Develop team doesn’t release i386 ISO images. But we can still install it on Debian x86 machines. Free disk space: At least 2GB (because of a large amount of dependencies) Memory: At least 512MB. I recommend you to use more than 1GB of memory. Inform: For easier usage, all those commands above will be run under user root. If you run Debian locally: use either sudo -i or sudo su to switch to root. If you login with SSH, you can directly login with user root. You can fetch a Debian base image form HUST’s mirror, my university: http://mirrors.hust.edu.cn/debian-cd/current/ The Essence of OMVOMV itself, is a large web server application based on Nginx, PHP, Python and more, which is similar to The Baota Platform. No binary and source code is included in OMV. Instead, every available code is written in interpreting language PHP, and this makes OMV born with cross-platform. On theory, once target architecture supports Debian, Dpkg, and OMV’s dependencies, you can run OMV on any possible architectures. OMV is based on Debian. When you successfully compile OMV, you will get a cross-platform, noarch Deb package. The compilation won’t invoke compilers to generate dedicated binary files. So you can install OMV on every Debian instance. Note: Debian-family systems using Dpkg can install, on theory. For example, Ubuntu. But it’s untested. Clone Source CodeDownloadOMV team deploys their code on GitHub. We clone it into directory omv. 1234# Install Git and Pipapt install git python3-pip# Clone source code, and put it under directory omvgit clone https://github.com/openmediavault/openmediavault.git omv Enter source directoryOMV’s core source code is under subdirectory deb: 1cd omv/deb CompilationThe compilation of OMV is a land of traps. It lacks documents. And the more terrible trap is that OMV’s Makefiled doesn’t follow common routines. Once you don’t read carefully, you won’t be able to find out the real build target. Thanksfully, you can easily build it. Install build tools1make install Start compilation1make binary After compilation, it will generate several Deb packages under omv/dev, just like: 12345678910111213$ ls *.debopenmediavault-clamav_5.0-1_all.debopenmediavault-diskstats_5.0-1_all.debopenmediavault-forkeddaapd_5.0-1_all.debopenmediavault-keyring_1.0_all.debopenmediavault-ldap_4.0.6-1_all.debopenmediavault-lvm2_5.0.1-1_all.debopenmediavault-nut_5.0-1_all.debopenmediavault-shairport_5.0-1_all.debopenmediavault-snmp_5.0-1_all.debopenmediavault-tftp_5.0-1_all.debopenmediavault-usbbackup_5.0.1-1_all.debopenmediavault_5.0.11_all.deb Trap: About the default build targetOMV’s default build target, aka. run make without arguments, is NOT compiling Deb packages. Instead, it just simply cleans subdirectories! Be careful, ‘cause I don’t wanna Tukkomi any more ε=(´ο｀*)))… Install OMVAdd OMV official repositoryFew dependencies of OMV is not available in Debian’s official repository. So OMV repository is required. Firstly, append this code to the end of /etc/apt/sources.list: 12# Openmediavault official repositorydeb http://packages.openmediavault.org/public usul main Secondly, install OMV repo keyring: 1234567# Install this revision compiled by ourselves:cd omv/debdpkg -i openmediavault-keyring_1.0_all.deb# And of course, you can install it online:wget http://packages.openmediavault.org/public/pool/main/o/openmediavault-keyring/openmediavault-keyring_1.0_all.debdpkg -i openmediavault-keyring_1.0_all.deb Then, update repositories: 1apt update Install basic dependencies12345# Packages provided by Debian 10apt install php-fpm php-json php-cgi php-cli php-mbstring ethtool python3-dialog acl xfsprogs jfsutils ntfs-3g sdparm postfix bsd-mailx cpufrequtils smartmontools uuid nfs-kernel-server proftpd-basic sshpass samba samba-common-bin rsync avahi-daemon libnss-mdns beep php-bcmath gdisk rrdtool collectd anacron cron-apt quota php-xml quotatool lvm2 watchdog libjson-perl liblocale-po-perl proftpd-mod-vroot libjavascript-minifier-xs-perl xmlstarlet socat rrdcached nginx wpasupplicant btrfs-progs samba-vfs-modules python3-pyudev python3-natsort jq chrony python3-netifaces python3-lxml salt-minion php-yaml python-click python3-click# Packages not provided by Debian 10. They are provided by OMVapt install monit php-pam libjs-extjs6 wsdd Here will be depedency errors. Continue with: 1apt --fix-broken install Then rerun the apt install commands above so that it can continue properly. Install OMV main packageTo install OMV with convenience, OMV developers bundled every installtion process into a meta-package, so that you won’t need to install plenty of packages. You can install either the official edition or our compiled version. Install the official editionYou can directly install OMV via official repo: 1apt install postfix openmediavault Your screen will be filled with logs. Just wait in patience until it succeeds. Bear in mind that once an error occurs, you won’t be able to use OMV! Install our own version12345# Re-enter the source directorycd omv/deb# Then, start installingdpkg -i openmediavault-keyring_1.0_all.deb # Keyringdpkg -i openmediavault_5.0.11_all.deb # Meta-package Fill the trap: Solve Unit file is maskedOn some machines like VPS, you may encounter the error Unit file is masked when installing OMV manually. It’s critical, often interrupts installtion. 1234567Failed to preset unit: Unit file /etc/systemd/system/openmediavault-cleanup-php.service is masked./usr/bin/deb-systemd-helper: error: systemctl preset failed on openmediavault-cleanup-php.service: No such file or directorydpkg: error processing package openmediavault (--configure): installed openmediavault package post-installation script subprocess returned error exit status 1 Errors were encountered while processing: openmediavaultE: Sub-process /usr/bin/dpkg returned an error code (1) Actually, once you know how systemd manages services, you will know that the so-called mask is a state, means that a service is getting “blocked”. So solution could be extremely easy: once you find a service masked, simply run the following commands to unmask, then reinstall until it can continue properly: 12# systemctl unmask &lt;SERVICE NAME REPORTED MASKED&gt;, for instance:systemctl unmask openmediavault-cleanup-php.service Launch OMVRun the following command to launch OMV. Actually, newer versions of OMV had been configured into auto-start system services. 1omv-run Type host’s IP address to open OMV’s login page. Default admin account is: Field Value Default username admin Default password openmediavault Add OMVExtras Plugin RepositoryOMVExtras is a plugin repository provided by OMV official. I recommend you to add it so that you can make use of more powerful plugins. The developer has a one-key installtion method: 1wget -O - http://omv-extras.org/install | bash Once you cannot fetch the script, save the following shell code as install.sh, chmod 755, and run: 12345678910111213141516171819202122232425262728293031323334353637383940414243444546#!/bin/bashdeclare -i versionurl=&quot;https://github.com/OpenMediaVault-Plugin-Developers/packages/raw/master/&quot;version=$(dpkg -l openmediavault | awk &#x27;$2 == &quot;openmediavault&quot; &#123; print substr($3,1,1) &#125;&#x27;)echo $&#123;version&#125;if [ $&#123;version&#125; -eq 5 ]; then echo &quot;Downloading omv-extras.org plugin for openmediavault 5.x ...&quot; file=&quot;openmediavault-omvextrasorg_latest_all5.deb&quot;elif [ $&#123;version&#125; -eq 4 ]; then echo &quot;Downloading omv-extras.org plugin for openmediavault 4.x ...&quot; file=&quot;openmediavault-omvextrasorg_latest_all4.deb&quot;elif [ $&#123;version&#125; -eq 3 ]; then echo &quot;Downloading omv-extras.org plugin for openmediavault 3.x ...&quot; file=&quot;openmediavault-omvextrasorg_latest_all3.deb&quot;elif [ $&#123;version&#125; -eq 2 ]; then echo &quot;Downloading omv-extras.org plugin for openmediavault 2.x ...&quot; file=&quot;openmediavault-omvextrasorg_latest_all.deb&quot;else echo &quot;Unsupported version of openmediavault&quot; exit 0fiif [ -f &quot;$&#123;file&#125;&quot; ]; then rm $&#123;file&#125;fiwget --no-check-certificate $&#123;url&#125;/$&#123;file&#125;if [ -f &quot;$&#123;file&#125;&quot; ]; then dpkg -i $&#123;file&#125; if [ $? -gt 0 ]; then echo &quot;Installing other dependencies ...&quot; apt-get -f install fi echo &quot;Updating repos ...&quot; apt-get updateelse echo &quot;There was a problem downloading the package.&quot;fiexit 0 After installtion, refresh your browser, then you’ll see a new OMV-Extras entry on the side panel. References OMV系列教程1——在Debian上安装OpenMediaVault开源NAS系统 (OMV Guide EP01: Install OMV on Debian) Unmask a Masked Service in Systemd - Ruan Bekker Why are some systemd services in the “masked” state? Install OMV5 on Debian 10 (Buster) OMV 5.x (development) - Openmediavault Forum 使用OpenMediaVault构建您自己的NAS (Build NAS on your own with OMV)","categories":[{"name":"Play with NAS","slug":"Play-with-NAS","permalink":"https://anclark.github.io/en/categories/Play-with-NAS/"},{"name":"Openmediavault","slug":"Play-with-NAS/Openmediavault","permalink":"https://anclark.github.io/en/categories/Play-with-NAS/Openmediavault/"}],"tags":[{"name":"Guide","slug":"Guide","permalink":"https://anclark.github.io/en/tags/Guide/"},{"name":"NAS","slug":"NAS","permalink":"https://anclark.github.io/en/tags/NAS/"},{"name":"OMV","slug":"OMV","permalink":"https://anclark.github.io/en/tags/OMV/"},{"name":"Openmediavault","slug":"Openmediavault","permalink":"https://anclark.github.io/en/tags/Openmediavault/"},{"name":"Debian","slug":"Debian","permalink":"https://anclark.github.io/en/tags/Debian/"}]}],"categories":[{"name":"Play with NAS","slug":"Play-with-NAS","permalink":"https://anclark.github.io/en/categories/Play-with-NAS/"},{"name":"Openmediavault","slug":"Play-with-NAS/Openmediavault","permalink":"https://anclark.github.io/en/categories/Play-with-NAS/Openmediavault/"}],"tags":[{"name":"Guide","slug":"Guide","permalink":"https://anclark.github.io/en/tags/Guide/"},{"name":"NAS","slug":"NAS","permalink":"https://anclark.github.io/en/tags/NAS/"},{"name":"OMV","slug":"OMV","permalink":"https://anclark.github.io/en/tags/OMV/"},{"name":"Openmediavault","slug":"Openmediavault","permalink":"https://anclark.github.io/en/tags/Openmediavault/"},{"name":"Debian","slug":"Debian","permalink":"https://anclark.github.io/en/tags/Debian/"}]}